Repository: shiinayane/BiliKit-Mac
Catalog: Packages/BiliKitCore/Sources/BiliLibraryFeature/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, zh_hant

# %lld月%lld日 %@
source: %1$lld月%2$lld日 %3$@
en: %1$lld/%2$lld, %3$@

source: 今天 %@
en: Today, %@
ja: 今日 %@

source: 加载更早的记录
en: Load earlier history
ja: 以前の履歴を読み込む
zh_hant: 載入更早的記錄

source: 在哔哩哔哩观看过的普通视频会显示在这里。
en: Regular videos watched on Bilibili will appear here.
ja: Bilibiliで視聴した通常動画がここに表示されます。
zh_hant: 在 Bilibili 看過的一般影片會顯示在這裡。

source: 已看完
en: Finished
ja: 視聴済み

source: 当前页没有普通视频记录，可以继续检查更早的历史。
en: This page has no regular videos. You can check earlier history.
ja: このページには通常動画がありません。以前の履歴を確認できます。
zh_hant: 這一頁沒有一般影片記錄，可以繼續查看更早的記錄。

source: 接口数据与当前客户端预期不一致。
en: The service response did not match what this version of BiliKit expected.
ja: サービスの応答がこのバージョンのBiliKitの想定と一致しません。
zh_hant: 服務傳回的資料與目前版本的 BiliKit 預期不符。

source: 无法加载观看历史
en: Couldn’t load watch history
ja: 視聴履歴を読み込めません
zh_hant: 無法載入觀看記錄

source: 昨天 %@
en: Yesterday, %@
ja: 昨日 %@

source: 暂无可显示的观看历史
en: No watch history to show
ja: 表示できる視聴履歴がありません
zh_hant: 沒有可顯示的觀看記錄

source: 服务暂时拒绝了请求，请降低频率后重试。
en: The service rejected the request. Wait and try again less frequently.
ja: サービスがリクエストを拒否しました。間隔を空けてやり直してください。
zh_hant: 服務暫時拒絕了要求，請降低頻率後再試。

source: 服务暂时无法完成请求（代码 %lld）。
en: The service couldn’t complete the request (code %lld).
ja: サービスがリクエストを完了できませんでした（コード %lld）。
zh_hant: 服務暫時無法完成要求（代碼 %lld）。

source: 正在加载更早的记录…
en: Loading earlier history…
ja: 以前の履歴を読み込み中…
zh_hant: 正在載入更早的記錄…

source: 正在加载观看历史
en: Loading watch history
ja: 視聴履歴を読み込み中
zh_hant: 正在載入觀看記錄

source: 登录状态已失效
en: Sign-in expired
ja: ログインの有効期限が切れました
zh_hant: 登入狀態已失效

source: 观看进度 %@
en: Watch progress %@
ja: 視聴位置 %@
zh_hant: 觀看進度 %@

source: 请检查网络连接后重试。
en: Check your network connection and try again.
ja: ネットワーク接続を確認して、やり直してください。
zh_hant: 請檢查網路連線後再試。

source: 请求受到限制
en: Request limited
ja: リクエストが制限されました
zh_hant: 要求受到限制

source: 请重新扫码登录后再试。
en: Scan a new QR code to sign in, then try again.
ja: QRコードで再度ログインしてからやり直してください。
zh_hant: 請重新掃描 QR Code 登入後再試。

source: 重试
en: Try again
ja: 再試行
zh_hant: 再試一次
